<template>
    <div>
        <table :class="s.fixed_header">
          <thead>
            <tr>
              <th>测试</th>
              <th>测试</th>
              <th>测试</th>
              <th>测试</th>
              <th>测试</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
            </tr>
            <tr>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
            </tr>
            <tr>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
            </tr>
            <tr>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
            </tr>
            <tr>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
            </tr>
            <tr>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
            </tr>
            <tr>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
              <td>测试测试测试测试测试测试测试测试测试测试测试测试测试测试</td>
            </tr>
          </tbody>
        </table>
    </div>
</template>
<script>
    export default {
        components: {},
        data() {
            return {}
        },
        computed: {

        },
        methods: {

        }
    }
</script>
<style module="s" lang="scss">
.fixed_header{
    table-layout: fixed;
    border-collapse: collapse;
    tbody{
        display:block;
        width: 100%;
        overflow: auto;
        height: 100px;
    }

    thead {
        background: black;
        color:#fff;
        tr {
            display: block;
        }
    }
    th,
    td {
        padding: 5px;
        text-align: left;
    }
}
</style>